<template>
  <div>
    <HeaderContent>
      <h2 class="text-4xl">
        Robot Welding
      </h2>
    </HeaderContent>
    <div class="grid grid-cols-2 gap-4">
      <div class="col-span-2 md:col-span-1">
        <img src="~/assets/DSC_043.jpg" alt="Robot Welding_1" class="rounded">
      </div>
      <p class="indent-8 col-span-2 md:col-span-1">
        การเชื่อมด้วยหุ่นยนต์เป็นอีกชื่อหนึ่งสําหรับการเชื่อมอัตโนมัติและเกี่ยวข้องกับหนึ่งในสองโซลูชั่นที่แตกต่างกัน ตัวเลือกหนึ่งคือการเชื่อมอัตโนมัติเต็มรูปแบบซึ่งเครื่องจักรจะนําทางโลหะผ่านกระบวนการทั้งหมดตั้งแต่ต้นจนจบ ในการเชื่อมกึ่งอัตโนมัติคนงานจะโหลดโลหะแล้วลบออกเมื่อกระบวนการเสร็จสมบูรณ์ พวกเขาได้รับการออกแบบมาโดยเฉพาะเพื่อทํางานเชื่อมเป็นเวลานานโดยไม่แตกหักและเพื่อลดเวลาในการโหลดและขนถ่ายและเวลาที่ใช้โดยย้ายจากจุดสิ้นสุดของการเชื่อมไปยังการเชื่อมเริ่มต้นของการเชื่อมอื่น เวลาเสริมเช่นเวลาเคลื่อนที่ของจุดเวลาการกระจัดของตําแหน่งและเวลาตรวจจับของจุดเริ่มต้นของการเชื่อมแต่ละครั้งจะเพิ่มขึ้นโดยการเพิ่มเวลาทํางานที่มีประสิทธิภาพ (เวลาโค้ง) เป็นในวงจรการทํางาน อัตราการอาร์คของการเชื่อมกึ่งอัตโนมัติแบบแมนนวลโดยทั่วไปอยู่ระหว่าง 35% ถึง 60% ในขณะที่อัตราการโค้งของหุ่นยนต์อัตโนมัติเต็มรูปแบบสูงถึง 80% ถึง 90% โดยเฉพาะอย่างยิ่งในการเชื่อมแผ่นหนายาวด้วยสถานีคู่ อัตราโค้งอาจใกล้เคียงกับ 100% <br>
        อย่างที่เราทราบกันดีว่าหุ่นยนต์มีแขนที่สามารถเคลื่อนที่ในสามมิติสําหรับประเภทเส้นตรงและผ่านระนาบมากขึ้นด้วยคําแนะนําที่ชัดเจน
      </p>
      <p class="indent-8 col-span-2 md:col-span-1">
        ตัวป้อนลวดจะส่งลวดฟิลเลอร์ไปยังหุ่นยนต์ตามที่ต้องการสําหรับตัวเลือกการเชื่อม ไฟฉายความร้อนสูงที่ปลายแขนละลายโลหะเพื่อให้กระบวนการเชื่อมและอุณหภูมิอาจสูงถึงหลายพันองศา ดังนั้นการใช้หุ่นยนต์สามารถลดการบาดเจ็บจากการเชื่อมที่เกิดจากการเชื่อมด้วยตนเอง การเชื่อมด้วยหุ่นยนต์สามารถจัดการโซลูชันการเชื่อมที่หลากหลายเช่นการเชื่อมอาร์คการเชื่อมความต้านทานการเชื่อมจุดการเชื่อม Tig การเชื่อมด้วยเลเซอร์และการเชื่อมพลาสม่า โดยการเรียนรู้ความแตกต่างใน
        <a class="underline decoration-sky-500 decoration-2 underline-offset-2" href="https://www.fabmann.com/fabmann-sheet-metal-fabrication" target="_blank">การผลิตโลหะ</a>กระบวนการนี้จะช่วยให้คุณตัดสินใจได้อย่างถูกต้องตามความต้องการในการผลิตของคุณ
      </p>
      <div class="col-span-2 md:col-span-1">
        <img src="~/assets/DSC_042.jpg" alt="Robot Welding_2" class="rounded">
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'MachineDComponent'
}
</script>
