<template>
  <div>
    <HeaderContent>
      <h2 class="text-4xl">
        Laser Cutting Machine
      </h2>
    </HeaderContent>
    <div class="grid grid-cols-2 gap-4">
      <div class="col-span-2 md:col-span-1">
        <img src="~/assets/DSC_048.jpg" alt="Laser Cutting Machine_1" class="rounded">
      </div>
      <p class="indent-8 col-span-2 md:col-span-1">
        อุปกรณ์ที่ใช้ในการตัดวัสดุที่มีประสิทธิภาพสูง เป็นเทคโนโลยีสำหรับการตัดชิ้นงานที่มีคุณภาพภายในระยะเวลาที่รวดเร็ว สามารถตัดวัสดุทั่วไปที่มีขนาดไม่หนามาก ปัจจุบันสามารถตัดได้หนาถึง 15มม สามารถตัดวัสดุที่มีรูปร่างซับซ้อนได้อย่างแม่นยำ การตัดโดยใช้เลเซอร์ เป็นการใช้ความร้อนจากลำแสงเลเซอร์ ซึ่งเป็นแสงที่มีช่วงความถี่คลื่นแคบ มีความเข้มและพลังงานสูงผ่านไปบนวัสดุ
      </p>
      <p class="indent-8 col-span-2 md:col-span-1">
        ทำให้บริเวณจุดที่รับลำแสงหลอมละลาย โดยเมื่อเคลื่อนแนวลำแสงนี้ ก็จะทำให้สามารถตัดชิ้นวัสดุได้ เครื่องตัดเลเซอร์ มีทั้งแบบตัดด้วยมือ และแบบติดตั้งกับระบบ CNC ซึ่งควบคุมการตัดด้วยคอมพิวเตอร์ โดยเฉพาะวัสดุที่มีรูปร่างซับซ้อน การใช้เลเซอร์ในการตัดจะได้ผลลัพธ์ที่น่าพึงพอใจและแม่นยำอย่างมากทีเดียว โดยระบบการตัดด้วยเลเซอร์นี้จะใช้ความร้อนผ่านไปบนวัตถุ ทำให้วัตถุบริเวณที่โดนความร้อนจากลำแสงละลายอย่างรวดเร็วและถูกตัดออกมาเป็นชิ้นอย่างละเมียดสวยงาม อีกทั้งเครื่องตัดเลเซอร์ดังกล่าวก็มี 2 แบบด้วยกัน คือแบบตัดด้วยมือ และแบบติดตั้งกับระบบ CNC ที่ควบคุมการตัดด้วยคอมพิวเตอร์
      </p>
      <div class="col-span-2 md:col-span-1">
        <img src="~/assets/DSC_049.jpg" alt="Laser Cutting Machine_2" class="rounded">
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'MachineCComponent'
}
</script>
