<template>
  <div>
    <HeaderContent>
      <h2 class="text-4xl">
        CNC Milling
      </h2>
    </HeaderContent>
    <div class="grid grid-cols-3 gap-4">
      <div class="col-span-3 md:col-span-1">
        <img src="~/assets/DSC_027.jpg" alt="CNC Milling_1" class="rounded">
      </div>
      <div class="col-span-3 md:col-span-2">
        <p class="indent-8">
          เครื่องกัด CNC หรือเครื่อง CNC Milling เป็นการรวมกันระหว่างเครื่องกัด เข้ากับเทคโนโลยีที่ควบคุมด้วยระบบคอมพิวเตอร์ ที่ช่วยเพิ่มประสิทธิภาพการทำงานของเครื่องกัด CNC มากขึ้นกว่าเดิม<br>
          จากที่เรารู้จัก<a class="underline decoration-sky-500 decoration-2 underline-offset-2" href="https://www.sumipol.com/knowledge/milling-machine/" target="_blank">การทำงานของเครื่องมิลลิ่งแบบธรรมดาแล้ว</a>บทความนี้มาทำความรู้จักกับเครื่องกัดอีกประเภทหนึ่ง ที่สามารถสั่งการด้วยระบบคอมพิวเตอร์ หรือที่เรียกกันว่าเครื่องกัด CNC ว่าเครื่องนี้จะมีประสิทธิภาพการทำงานเพิ่มขึ้นจากเครื่องกัดแบบธรรมดาอย่างไรบ้าง
        </p>
        <div>
          <div>
            <HeaderContent>
              <h4>
                ระบบ CNC คืออะไร?
              </h4>
            </HeaderContent>
            <p class="indent-8">
              CNC ย่อมาจาก Computer Numeric Control เป็นรหัสคำสั่งที่ใช้ในการควบคุมการเคลื่อนที่ของเครื่องมือ โดยชุดคำสั่งนี้มาจากการออกแบบภาพเสมือนจริงด้วยโปรแกรมคอมพิวเตอร์ ก่อนที่จะแปลงมาเป็นชุดคำสั่งเพื่อใช้ในการควบคุมการทำงานของเครื่องจักร
            </p>
            <p>
              รู้จักกับเครื่องกัด CNC<br>
              เครื่อง CNC Milling ที่รวมเอาระบบ CNC เข้ามาไว้ในเครื่องกัดนั้น จะมีระบบควบคุมการทำงานของหัวกัดให้ไปในทิศทางที่ต้องการ เพื่อทำการกัดเอาชิ้นส่วนที่ไม่ต้องการบนชิ้นงานออกไป
            </p>
          </div>
        </div>
      </div>
      <p class="col-span-3">
        ความแตกต่างของเครื่องกัด CNC กับเครื่องกัดแบบธรรมดา<br>
        การทำงานของเครื่องกัด CNC สามารถหมุนดอกกัดด้วยความเร็วรอบถึง 1,000 รอบต่อนาที ซึ่งความเร็วรอบขึ้นอยู่กับความต้องการของการทำงาน โดยการเคลื่อนที่ของหัวกัดจะไปในแนวแกน X และ Y ตามการสั่งการของระบบ ทำให้ได้ชิ้นงานที่มีรายละเอียดและมีความเฉพาะเจาะจง
        ส่วนการทำงานของเครื่องกัดแบบธรรมดา แม้ว่าจะมีการเคลื่อนที่หัวกัดไปในแนวแกน X และ Y เหมือนกับเครื่องกัด CNC แต่การรอบการหมุนของดอกกัดจะมีข้อจำกัดอยู่ ทำให้การเคลื่อนที่ของดอกกัดมีความอิสระน้อยกว่า และควบคุมการทำงานเป็นระบบ Manual จึงทำงานกัดวัสดุที่มีความเฉพาะเจาะจงบนชิ้นงานได้ไม่ดีเท่ากับเครื่องกัด CNC
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'MachineGComponent'
}
</script>
