<template>
  <div class="mx-auto max-w-7xl px-6 lg:px-8 pb-24 sm:pb-32">
    <div id="accordion-color" data-accordion="collapse" data-active-classes="bg-blue-100 text-blue-600">
      <h2 id="accordion-color-heading-1">
        <button type="button" class="flex items-center justify-between w-full p-5 font-medium text-left text-gray-500 border border-gray-200 rounded-t-xl focus:ring-4 focus:ring-blue-200" @click=" isOpen = !isOpen">
          <span>คุณภาพของเหล็กที่ดีคืออะไร?</span>
          <svg
            v-if="isOpen"
            data-accordion-icon
            class="w-6 h-6 rotate-180 shrink-0"
            fill="currentColor"
            viewBox="0 0 20 20"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path fill-rule="evenodd" d="M5.293 7.293a1 1 0 011.414 0L10 10.586l3.293-3.293a1 1 0 111.414 1.414l-4 4a1 1 0 01-1.414 0l-4-4a1 1 0 010-1.414z" clip-rule="evenodd" />
          </svg>
          <svg
            v-else
            data-accordion-icon
            class="w-6 h-6 shrink-0"
            fill="currentColor"
            viewBox="0 0 20 20"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path fill-rule="evenodd" d="M5.293 7.293a1 1 0 011.414 0L10 10.586l3.293-3.293a1 1 0 111.414 1.414l-4 4a1 1 0 01-1.414 0l-4-4a1 1 0 010-1.414z" clip-rule="evenodd" />
          </svg>
        </button>
      </h2>
      <div v-if="isOpen" id="accordion-color-body-1" aria-labelledby="accordion-color-heading-1">
        <div class="p-5 border border-gray-200">
          <p class="mb-2 text-gray-500">
            หากพูดถึงคุณสมบัติของวัสดุ จะพบว่าเหล็กเป็นวัสดุที่มีความสำคัญทางด้านวิศวกรรม และการก่อสร้างมากที่สุดในโลก
            คุณสมบัติที่สำคัญที่สุดของเหล็กก็คือความสามารถในการขึ้นรูปได้ และความทนทานที่ยอดเยี่ยม รวมทั้งยืดหยุ่นได้ดี, มีค่าจุดคราก และการนำความร้อนที่ดี ตลอดจนคุณสมบัติที่สำคัญอีกอย่างหนึ่งที่มีในเหล็กกล้าไร้สนิม นั้นคือความทนทานต่อการกัดกร่อน
            เมื่อทำการเลือกวัสดุไปใช้ในงานที่จำเพาะเจาะจงแล้ว วิศวกรต้องมีความมั่นใจในความเหมาะสมของ สภาวะการรับแรง และความทนต่อสภาพแวดล้อมต่างๆ และนี่คือหัวข้อที่อยู่ในการบริการของเรา ความเข้าใจ และการควบคุมคุณสมบัติของวัสดุให้ได้นั้นเป็นสิ่งจำเป็น คุณสมบัติทางกลของเหล็กสามารถทำการควบคุมได้โดยอาศัยการเลือก
            <a class="underline decoration-sky-500 decoration-2 underline-offset-2" href="https://www.totalmateria.com/page.aspx?ID=MetalComposition&LN=TH" target="_blank">chemส่วนประกอบทางเคมี</a> ที่เหมาะสม, กระบวนการ และกระบวนการอบร้อน หรือจนถึงการตรวจสอบโครงสร้างระดับจุลภาค
            อัลลอยด์ และกระบวนการอบร้อนถูกใช้ในการผลิตเหล็ก ผลที่ได้นั้นจะมีความแตกต่างกันทั้งค่าคุณสมบัติ และความแข็งแกร่ง ส่วนในการทดสอบนั้นต้องดำเนินการทดสอบไปจนถึงคุณสมบัติสุดท้ายของเหล็ก เพื่อให้มั่นใจได้ว่าเป็นมาตรฐานที่น่าเชื่อถือ
            มีระบบการวัดอยู่หลายรูปแบบที่ใช้ในการระบุคุณสมบัติของเหล็ก ตัวอย่างเช่น จุดคราก, ความอ่อน และความแข็งตึง สามาหาหาได้โดยใช้การทดสอบแรงดึง ความเหนียวสามารถวัดค่าได้โดยใช้การทดสอบอิมแพ็ค ส่วนค่าความแข็ง สามารถหาได้โดยวัดจากความต้านทานในการเจาะพื้นผิวของวัสดุแข็ง
            การทดสอบแรงดึง เป็นวิธีการในการประเมินผลตอบสนองของโครงสร้างของเหล็ก เมื่อได้รับโหลด ซึ่งผลลัพธ์จะแสดงในค่าความสัมพันธ์ระหว่าง ความเค้น และความเครียด โดยที่ค่าความสัมพันธ์ระหว่าง ความเค้น และความเครียด สามารถวัดได้จากช่วงยืดหยุ่นของวัสดุ และอัตราส่วนโมดูลัสของยัง ค่าโมดูลัสของยังที่สูงนั้น จะแสดงถึงความแตกต่างของคุณสมบัติเหล็ก ซึ่งจะอยู่ในช่วง 190-210 GPa และมีค่าเป็นสามเท่าของอลูมิเนียม
            คุณสมบัติทางกายภาพของเหล็กจะมีความเกี่ยวพันธ์กับลักษณะทางกายภาพของวัสดุ เช่น ความหนาแน่น, สภาพการนำความร้อน, โมดูลัสของสภาพยืดหยุ่น, อัตราส่วนของปัวซอง, อื่นๆ ค่าโดยทั่วไปขอคุณสมบัติทางกายภาพของเหล็กได้แก่:

            <ul class="list-inside list-disc">
              <li>ความหนาแน่น ρ = 7.7 ÷ 8.1 [kg/dm3] </li>
              <li>โมดูลัสของสภาพยืดหยุ่น E=190÷210 [GPa]  </li>
              <li>อัตราส่วนของปัวซอง ν = 0.27 ÷ 0.30  </li>
              <li>สภาพการนำความร้อน κ = 11.2 ÷ 48.3 [W/mK] </li>
              <li>สัมประสิทธิ์การขยายตัวเนื่องจากความร้อน α = 9 ÷27 [10-6 / K] </li>
            </ul>
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'TalkComponent',
  data () {
    return {
      isOpen: true
    }
  },
  mounted () {
    document.addEventListener('keydown', (e) => {
      if (e.keyCode === 27 && this.isOpen) { this.isOpen = true }
    })
  }
}
</script>
